In [19]:
import pandas as pd
df1 = pd.DataFrame({
    'city':["new york","chicago","orlando","baltimore"],
    'temperature':[21,14,35,32]
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [21]:
df2 = pd.DataFrame({
    'city':["chicago","new york","san francisco"],
    'humidity':[65,68,71]
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [34]:
"""
we want to merge both dataframes to get a dataframe which shows data
for both temperature and humidity
merge(df name, df names, on-column)

how=outer creates an outter joing, creating a union of both those tables
and including them in our dataframe
how=inner is default -inner join
left-takes orlando and baltimore
right takes san francisco

if we want to know which dataframes these elements are coming from
left or right using indicator=True
"""
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)

In [35]:
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

In [37]:
"""
last arguement called suffixes
lets say you have a common column in both dataframes
"""
df1= pd.DataFrame({
    'city':['new york','chicago','orlando','baltimore'],
    'temperature':[21,14,35,38],
    'humidity':[65,68,71,75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [38]:
df2 = pd.DataFrame({
    'city': ["chicago","new york","san diego"],
    'temperature':[21,14,35],
    'humidity':[65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [41]:
"""
joining these two dataframes
the data frame show x and y
if you want your own suffixes you can append the suffixes column
"""
df3=pd.merge(df1,df2,on="city",suffixes=('_left','_right'))

In [42]:
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65